PaoloP74/Agrumino-Dev/boards.txt
#
# Do not create pull-requests for this file only, CI will not accept them.
# You *must* edit/modify/run boards.txt.py to regenerate boards.txt.
# All modified files after running with option "--allgen" must be included in the pull-request.
#

menu.BoardModel=Model
menu.UploadSpeed=Upload Speed
menu.CpuFrequency=CPU Frequency
menu.CrystalFreq=Crystal Frequency
menu.FlashSize=Flash Size
menu.FlashMode=Flash Mode
menu.FlashFreq=Flash Frequency
menu.ResetMethod=Reset Method
menu.ESPModule=Module
menu.Debug=Debug port
menu.DebugLevel=Debug Level
menu.LwIPVariant=lwIP Variant
menu.VTable=VTables
menu.led=Builtin Led
menu.FlashErase=Erase Flash

##############################################################
agrumino.name=Agrumino Lemon (WT8266 Module)
agrumino.build.board=ESP8266_agrumino
agrumino.build.variant=agrumino
agrumino.upload.tool=esptool
agrumino.upload.maximum_data_size=81920
agrumino.upload.wait_for_upload_port=true
agrumino.upload.erase_cmd=
agrumino.serial.disableDTR=true
agrumino.serial.disableRTS=true
agrumino.build.mcu=esp8266
agrumino.build.core=esp8266
agrumino.build.spiffs_pagesize=256
agrumino.build.debug_port=
agrumino.build.debug_level=
agrumino.build.f_cpu=80000000L
agrumino.upload.resetmethod=nodemcu
agrumino.menu.VTable.flash=Flash
agrumino.menu.VTable.flash.build.vtable_flags=-DVTABLES_IN_FLASH
agrumino.menu.VTable.heap=Heap
agrumino.menu.VTable.heap.build.vtable_flags=-DVTABLES_IN_DRAM
agrumino.menu.VTable.iram=IRAM
agrumino.menu.VTable.iram.build.vtable_flags=-DVTABLES_IN_IRAM
agrumino.build.flash_mode=qio
agrumino.build.flash_freq=40
agrumino.build.flash_size=2M
agrumino.build.flash_size_bytes=0x200000
agrumino.build.flash_ld=eagle.flash.2m.ld
agrumino.build.spiffs_pagesize=256
agrumino.upload.maximum_size=1044464
agrumino.build.rfcal_addr=0x1FC000
agrumino.build.spiffs_start=0x100000
agrumino.build.spiffs_end=0x1FB000
agrumino.build.spiffs_blocksize=8192
agrumino.menu.LwIPVariant.v2mss536=v2 Lower Memory
agrumino.menu.LwIPVariant.v2mss536.build.lwip_include=lwip2/include
agrumino.menu.LwIPVariant.v2mss536.build.lwip_lib=-llwip2
agrumino.menu.LwIPVariant.v2mss536.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536
agrumino.menu.LwIPVariant.v2mss1460=v2 Higher Bandwidth
agrumino.menu.LwIPVariant.v2mss1460.build.lwip_include=lwip2/include
agrumino.menu.LwIPVariant.v2mss1460.build.lwip_lib=-llwip2_1460
agrumino.menu.LwIPVariant.v2mss1460.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460
agrumino.menu.LwIPVariant.Prebuilt=v1.4 Higher Bandwidth
agrumino.menu.LwIPVariant.Prebuilt.build.lwip_lib=-llwip_gcc
agrumino.menu.LwIPVariant.Prebuilt.build.lwip_flags=-DLWIP_OPEN_SRC
agrumino.menu.LwIPVariant.OpenSource=v1.4 Compile from source
agrumino.menu.LwIPVariant.OpenSource.build.lwip_lib=-llwip_src
agrumino.menu.LwIPVariant.OpenSource.build.lwip_flags=-DLWIP_OPEN_SRC
agrumino.menu.LwIPVariant.OpenSource.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
agrumino.menu.Debug.Disabled=Disabled
agrumino.menu.Debug.Disabled.build.debug_port=
agrumino.menu.Debug.Serial=Serial
agrumino.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
agrumino.menu.Debug.Serial1=Serial1
agrumino.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
agrumino.menu.DebugLevel.None____=None
agrumino.menu.DebugLevel.None____.build.debug_level=
agrumino.menu.DebugLevel.SSL=SSL
agrumino.menu.DebugLevel.SSL.build.debug_level= -DDEBUG_ESP_SSL
agrumino.menu.DebugLevel.TLS_MEM=TLS_MEM
agrumino.menu.DebugLevel.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
agrumino.menu.DebugLevel.HTTP_CLIENT=HTTP_CLIENT
agrumino.menu.DebugLevel.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
agrumino.menu.DebugLevel.HTTP_SERVER=HTTP_SERVER
agrumino.menu.DebugLevel.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
agrumino.menu.DebugLevel.SSLTLS_MEM=SSL+TLS_MEM
agrumino.menu.DebugLevel.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
agrumino.menu.DebugLevel.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
agrumino.menu.DebugLevel.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
agrumino.menu.DebugLevel.SSLHTTP_SERVER=SSL+HTTP_SERVER
agrumino.menu.DebugLevel.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
agrumino.menu.DebugLevel.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
agrumino.menu.DebugLevel.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
agrumino.menu.DebugLevel.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
agrumino.menu.DebugLevel.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
agrumino.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
agrumino.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
agrumino.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
agrumino.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
agrumino.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
agrumino.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
agrumino.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
agrumino.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
agrumino.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
agrumino.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
agrumino.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
agrumino.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
agrumino.menu.DebugLevel.CORE=CORE
agrumino.menu.DebugLevel.CORE.build.debug_level= -DDEBUG_ESP_CORE
agrumino.menu.DebugLevel.WIFI=WIFI
agrumino.menu.DebugLevel.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
agrumino.menu.DebugLevel.HTTP_UPDATE=HTTP_UPDATE
agrumino.menu.DebugLevel.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
agrumino.menu.DebugLevel.UPDATER=UPDATER
agrumino.menu.DebugLevel.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
agrumino.menu.DebugLevel.OTA=OTA
agrumino.menu.DebugLevel.OTA.build.debug_level= -DDEBUG_ESP_OTA
agrumino.menu.DebugLevel.OOM=OOM
agrumino.menu.DebugLevel.OOM.build.debug_level= -DDEBUG_ESP_OOM
agrumino.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
agrumino.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
agrumino.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
agrumino.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
agrumino.menu.DebugLevel.NoAssert-NDEBUG=NoAssert-NDEBUG
agrumino.menu.DebugLevel.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
agrumino.menu.FlashErase.none=Only Sketch
agrumino.menu.FlashErase.none.upload.erase_cmd=
agrumino.menu.FlashErase.sdk=Sketch + WiFi Settings
agrumino.menu.FlashErase.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
agrumino.menu.FlashErase.all=All Flash Contents
agrumino.menu.FlashErase.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
agrumino.menu.UploadSpeed.115200=115200
agrumino.menu.UploadSpeed.115200.upload.speed=115200
agrumino.menu.UploadSpeed.9600=9600
agrumino.menu.UploadSpeed.9600.upload.speed=9600
agrumino.menu.UploadSpeed.57600=57600
agrumino.menu.UploadSpeed.57600.upload.speed=57600
agrumino.menu.UploadSpeed.230400.linux=230400
agrumino.menu.UploadSpeed.230400.macosx=230400
agrumino.menu.UploadSpeed.230400.upload.speed=230400
agrumino.menu.UploadSpeed.256000.windows=256000
agrumino.menu.UploadSpeed.256000.upload.speed=256000
agrumino.menu.UploadSpeed.460800.linux=460800
agrumino.menu.UploadSpeed.460800.macosx=460800
agrumino.menu.UploadSpeed.460800.upload.speed=460800
agrumino.menu.UploadSpeed.512000.windows=512000
agrumino.menu.UploadSpeed.512000.upload.speed=512000
agrumino.menu.UploadSpeed.921600=921600
agrumino.menu.UploadSpeed.921600.upload.speed=921600
